tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "romkatv/powerlevel10k"
# Search tool like grep, but optimized for programmers
brew "ack"
# Shell extension to jump to frequently used directories
brew "autojump"
# Identify or delete duplicate files
brew "fdupes"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# AVH edition of git-flow
brew "git-flow-avh"
# Image processing tools collection
brew "graphicsmagick"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Mac App Store command-line interface
brew "mas"
# Platform built on V8 to build network applications
brew "node"
# Monitor data's progress through a pipe
brew "pv"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A Zsh Theme
brew "romkatv/powerlevel10k/powerlevel10k"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Utility to create and modify archives
cask "betterzip"
# Test localhost and staging websites
cask "browserstacklocal"
# Web debugging Proxy application
cask "charles"
# Clipboard extension app
cask "clipy"
# Visually compare and merge files
cask "diffmerge"
# App to build and share containerized applications and microservices
cask "docker"
# QuickLook generator and Spotlight importer
cask "epubquicklook"
# Web browser
cask "firefox"
# Web browser
cask "firefox-developer-edition"
# Web browser
cask "google-chrome"
# Web browser
cask "google-chrome-canary"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# QuickLook generator for Markdown files
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklook-pat"
cask "quicklookase"
# Graphical client for Git version control
cask "sourcetree"
# Move and resize windows with ease
cask "spectacle"
# Quicklook extension for source files
cask "syntax-highlight"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Unpacks archive files
cask "the-unarchiver"
# Open-source code editor
cask "visual-studio-code"
cask "webpquicklook"
# JavaScript IDE
cask "webstorm"
