tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "romkatv/powerlevel10k"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Shell extension to jump to frequently used directories
brew "autojump"
# Identify or delete duplicate files
brew "fdupes"
# Distributed revision control system
brew "git"
# Mac App Store command-line interface
brew "mas"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A Zsh Theme
brew "romkatv/powerlevel10k/powerlevel10k"
# Utility to create and modify archives
cask "betterzip"
# Clipboard extension app
cask "clipy"
# Color picking application
cask "colorsnapper"
# Visually compare and merge files
cask "diffmerge"
# Companion app for scanner hardware
cask "doxie"
# Password and credentials mananger
cask "enpass"
# Web browser
cask "firefox-developer-edition"
cask "font-caskaydia-cove-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monoid-nerd-font"
cask "font-victor-mono-nerd-font"
# Menu bar calendar
cask "itsycal"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# QuickLook generator for Markdown files
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklook-pat"
# QuickLook generator for Adobe Swatch Exchange files
cask "quicklookase"
# Graphical client for Git version control
cask "sourcetree"
# Move and resize windows with ease
cask "spectacle"
# Messaging app with a focus on speed and security
cask "telegram"
# Unpacks archive files
cask "the-unarchiver"
# Time tracker
cask "toggl-track"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
cask "webpquicklook"
mas "Contrast", id: 1254981365
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Vectornator", id: 1219074514
