tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
# Search tool like grep, but optimized for programmers
brew "ack"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Identify or delete duplicate files
brew "fdupes"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# AVH edition of git-flow
brew "git-flow-avh"
# Image processing tools collection
brew "graphicsmagick"
# Mac App Store command-line interface
brew "mas"
# Monitor data's progress through a pipe
brew "pv"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
cask "adobe-acrobat-reader"
cask "charles"
cask "clipy"
cask "docker"
cask "epubquicklook"
cask "firefox"
cask "firefox-developer-edition"
cask "gas-mask"
cask "ghostlab"
cask "google-chrome"
cask "hetimazipql"
cask "kitematic"
cask "microsoft-teams"
cask "onedrive"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "skype-for-business"
cask "slack"
cask "sourcetree"
cask "spectacle"
cask "teamviewer"
cask "the-unarchiver"
cask "visual-studio-code"
cask "webpquicklook"
cask "webstorm"
